Загрузка данных (1 балл)

In [1]:
import pandas as pd

# Загрузка данных
df = pd.read_csv('train.csv')

# Проверка загрузки (первые 5 строк)
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

Анализ данных (1 балл)

In [2]:
# Основная информация о датасете
print(df.info())

# Описательная статистика
print(df.describe())

# Число пропусков в каждом столбце
print(df.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Процент выживаемости по классам (1 балл)

In [3]:
survival_by_class = df.groupby('Pclass')['Survived'].mean() * 100
print(survival_by_class)

Pclass
1    62.962963
2    47.282609
3    24.236253
Name: Survived, dtype: float64

Самые популярные имена (1 балл)

In [4]:
df['FirstName'] = df['Name'].str.split(', ').str[1].str.split('.').str[1].str.strip()

male_names = df[df['Sex'] == 'male']['FirstName'].mode()
female_names = df[df['Sex'] == 'female']['FirstName'].mode()

print("Самое популярное мужское имя:", male_names[0])
print("Самое популярное женское имя:", female_names[0])

Самое популярное мужское имя: John
Самое популярное женское имя: Mary

Популярные имена по классам (2 балла)

In [5]:
for pclass in sorted(df['Pclass'].unique()):
    males = df[(df['Pclass'] == pclass) & (df['Sex'] == 'male')]['FirstName'].mode()
    females = df[(df['Pclass'] == pclass) & (df['Sex'] == 'female')]['FirstName'].mode()
    print(f"Класс {pclass}: Мужское имя — {males[0]}, Женское имя — {females[0]}")

Класс 1: Мужское имя — Charles H, Женское имя — (Edith Martha Bowerman)
Класс 2: Мужское имя — William John, Женское имя — Bertha
Класс 3: Мужское имя — James, Женское имя — Mary

Пассажиры старше 44 лет (1 балл)

In [7]:
older_than_44 = df[df['Age'] > 44]
print(older_than_44[['Name', 'Age', 'Pclass']])

                                                  Name   Age  Pclass
6                              McCarthy, Mr. Timothy J  54.0       1
11                            Bonnell, Miss. Elizabeth  58.0       1
15                    Hewlett, Mrs. (Mary D Kingcome)   55.0       2
33                               Wheadon, Mr. Edward H  66.0       2
52            Harper, Mrs. Henry Sleeper (Myna Haxtun)  49.0       1
..                                                 ...   ...     ...
857                             Daly, Mr. Peter Denis   51.0       1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  48.0       1
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0       1
873                        Vander Cruyssen, Mr. Victor  47.0       3
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0       1

[115 rows x 3 columns]

Мужчины младше 44 лет (2 балла)

In [8]:
young_males = df[(df['Age'] < 44) & (df['Sex'] == 'male')]
print(young_males[['Name', 'Age', 'Pclass']])

                               Name   Age  Pclass
0           Braund, Mr. Owen Harris  22.0       3
4          Allen, Mr. William Henry  35.0       3
7    Palsson, Master. Gosta Leonard   2.0       3
12   Saundercock, Mr. William Henry  20.0       3
13      Andersson, Mr. Anders Johan  39.0       3
..                              ...   ...     ...
883   Banfield, Mr. Frederick James  28.0       2
884          Sutehall, Mr. Henry Jr  25.0       3
886           Montvila, Rev. Juozas  27.0       2
889           Behr, Mr. Karl Howell  26.0       1
890             Dooley, Mr. Patrick  32.0       3

[368 rows x 3 columns]

Анализ кают (1 балл)

In [10]:
df['CabinDeck'] = df['Cabin'].str[0] if 'Cabin' in df.columns else 'Unknown'

cabin_counts = df['CabinDeck'].value_counts()
print("Распределение по каютам:\n", cabin_counts)

Распределение по каютам:
 CabinDeck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: count, dtype: int64